export default function AboutUs() {
  return (
    <section className="about-us">
      <div className="container">
        <div className="about__header">
          <div className="about-img-top">
            <img src={require("../media/photo7763597096.jpg")} alt="" />
            <img
              src={require("../media/bigDotes.png")}
              className="dotted"
              alt=""
            />
          </div>
          <div>
            <h4>خودروسازان دیزلی آذربایجان</h4>
            <p>
              شرکت خودروسازان دیزلی آذربایجان از شرکت‌های وابسته به گروه صنایع
              تراکتورسازی ایران واقع در تبریز می‌باشد که با هدف تولید و عرضه
              خودروهای حمل بار کامیونت و کامیون سبک و نیمه سنگین تاسیس شده‌ است
              .
            </p>
          </div>
        </div>
        <div className="about_text">
          <p>
            کامیونت سری آذرخش و کامیونت / کامیون‌های سری کادیا در این شرکت
            طراحی، تولید و عرضه شده‌اند. طراحی و تولید محصولات سری‌های آذرخش و
            کادیا عمدتا متکی بر دانش فنی و امکانات سازندگان داخلی بوده است به
            نحوی که در تولید کامیونت آذرخش از ابتدای معرفی به بازار، درصد شاخص
            بالاتر از 75% حاصل شده‌است کخ در نوع خود در کشور بی‌نظیر می باشد .
            باتوجه به تغییرات سریع تکنولوژی صنعت خودرو و ارتقای الزامات
            استانداردی در کشور، این شرکت در سنوات اخیر محصولات جدیدی را با
            همکاری شرکتهای خارجی مونتاژ و معرفی نموده است . مشخصات و ویژگی های
            این محصولات در قسمت ‌های دیگر تارنمای اینترنتی در دسترس علاقمندان
            قرار گرفته است . درسال 1399 سایت تولید کاربری خودروهای تجاری نیز در
            جوار کارخانه راه اندازی شده و پروانه بهره برداری کاربری سازی نی از
            سازمان صنعت ، معدن و تجارت اخذ شده است .
          </p>
          <img src={require("../media/picture-c500-1.jpg")} alt="" />

          <p>
            دست همکاری قطعه سازان داخلی، فعالان حوزه خدمات پس از فروش ، شرکت‌های
            کاربری سازی ، دانشگاهیان و شرکت های دانش بنیان، تمیرکاران خودروهای
            کامیونت و کامیون را در تولید باکیفیت، اقتصادی تر و ارائه خدمات مناسب
            تر به مشتریان می فشاریم . امید است اقدامات این شرکت در رفع نیازهای
            کشور عزیزمان در حوزه حمل و نقل کالا و جلب رضایت هموطنان و رانندگان
            محترم مفید و موثر واقع شود .
          </p>
        </div>
      </div>
    </section>
  );
}
