export default function AboutUs() {
  return (
    <section className="about-us">
      <div className="container">
        <div className="about__header">
          <div className="about-img-top">
            <img
              src="https://amicoir.com/images/1401/06/10/800px-____1.jpg"
              alt=""
            />
            <img
              src={require("../media/bigDotes.png")}
              className="dotted"
              alt=""
            />
          </div>
          <div>
            <h4>خودرو در یک نگاه</h4>
            <p>
              گروه صنعتی آمیکو فعالیت صنعتی تولیدی خود را از سال 1368 با تأسیس
              شرکت صنعتی آذر موتور و ثبت جهانی برند Azar Motor Industrial CO با
              علامت اختصاری آمیکو (AMICO) در منطقه جلفا (مرز بین کشورهای
              آذربایجان، ارمنستان و ترکیه) آغاز کرده است.
            </p>
          </div>
        </div>
        <div className="about_text">
          <p>
            شرکت ارس خودرو دیزل بزرگ‌ترین شرکت تولیدی گروه آمیکو با استفاده از
            نیروی انسانی متخصص و متعهد و برخورداری از تکنولوژی روز دنیا در حوزه
            تولید و مونتاژ خودرو، قادر به تولید انواع خودروهای تجاری و سواری
            است. این شرکت توانسته است با استفاده از قطعات و تکنولوژی برترین
            برندهای اروپائی، آمریکائی و آسیائی و همچنین کسب گواهی‌نامه‌های
            استاندارد ایمنی آلایندگی محصولات دیزلی برای محصولات دوگانه‌سوز
            (بنزین و گاز) از مؤسسات بین‌المللی TUV و VCA و سازمان محیط‌زیست
            ایران، محصولات خود را ازنظر کیفی، ایمنی و سطح آلایندگی در ردیف
            خودروهای معتبر اروپایی قرار دهد. آمیکو علاوه بر دریافت علامت
            استاندارد ایران و ثبت آن بر روی تمامی محصولات تولیدی خود،
            آزمایشگاه‌های مجهز و پیشرفته‌ای ایجاد کرده است که قادر به آزمایش
            محصولات، حفظ کیفیت و اطمینان از مطابقت با استانداردهای روز دنیا
            هستند. همچنین آمیکو دارای گواهی تائید صلاحیت آزمایشگاه همکار از
            موسسه استاندارد و تحقیقات صنعتی ایران است؛ بنابراین، آمیکو همچنین
            می‌تواند گواهی‌های استاندارد را برای تولیدکنندگان دیگر صادر کند.
            شرکت‌های گروه آمیکو به پشتوانه حضور مؤثر بنیان‌گذار خود، طی مدت 30
            سال از احداث اولین واحد صنعتی، اقدام به توسعه و تأسیس شرکت‌ها و
            مؤسسات متعددی نموده که مهم‌ترین آن‌ها به شرح ذیل است:
          </p>
          <img
            src="https://amicoir.com/images/1401/06/10/800px-____1.jpg"
            alt=""
            className="about_secendImg"
          />
          <p>
            آمیکو علاوه بر دریافت علامت استاندارد ایران و ثبت آن بر روی تمامی
            محصولات تولیدی خود، آزمایشگاه‌های مجهز و پیشرفته‌ای ایجاد کرده است
            که قادر به آزمایش محصولات، حفظ کیفیت و اطمینان از مطابقت با
            استانداردهای روز دنیا هستند. همچنین آمیکو دارای گواهی تائید صلاحیت
            آزمایشگاه همکار از موسسه استاندارد و تحقیقات صنعتی ایران است؛
            بنابراین، آمیکو همچنین می‌تواند گواهی‌های استاندارد را برای
            تولیدکنندگان دیگر صادر کند.
          </p>
        </div>
      </div>
    </section>
  );
}
